In [1]:
import pandas as pd

In [2]:
!pip install pandas

WARNING: pip is being invoked by an old script wrapper. This will fail in a future version of pip.
Please see https://github.com/pypa/pip/issues/5599 for advice on fixing the underlying issue.
To avoid this problem you can invoke Python with '-m pip' instead of running pip directly.
Requirement already satisfied: pandas in /srv/conda/envs/notebook/lib/python3.7/site-packages (1.1.2)
Requirement already satisfied: pytz>=2017.2 in /srv/conda/envs/notebook/lib/python3.7/site-packages (from pandas) (2020.1)
Requirement already satisfied: python-dateutil>=2.7.3 in /srv/conda/envs/notebook/lib/python3.7/site-packages (from pandas) (2.8.1)
Requirement already satisfied: numpy>=1.15.4 in /srv/conda/envs/notebook/lib/python3.7/site-packages (from pandas) (1.19.2)
Requirement already satisfied: six>=1.5 in /srv/conda/envs/notebook/lib/python3.7/site-packages (from python-dateutil>=2.7.3->pandas) (1.14.0)

In [5]:
import pandas as pd

In [7]:
surveys_df = pd.read_csv("data/surveys.csv")

In [8]:
surveys_df

,record_id,month,day,year,plot_id,species_id,sex,hindfoot_length,weight
0,1,7,16,1977,2,NL,M,32.0,NaN
1,2,7,16,1977,3,NL,M,33.0,NaN
2,3,7,16,1977,2,DM,F,37.0,NaN
3,4,7,16,1977,7,DM,M,36.0,NaN
4,5,7,16,1977,3,DM,M,35.0,NaN
...,...,...,...,...,...,...,...,...,...
35544,35545,12,31,2002,15,AH,NaN,NaN,NaN
35545,35546,12,31,2002,15,AH,NaN,NaN,NaN
35546,35547,12,31,2002,10,RM,F,15.0,14.0
35547,35548,12,31,2002,7,DO,M,36.0,51.0
35548,35549,12,31,2002,5,NaN,NaN,NaN,NaN

In [9]:
type(surveys_df)

pandas.core.frame.DataFrame

In [13]:
surveys_df["sex"].dtype

dtype('O')

In [15]:
surveys_df["record_id"].dtype

dtype('int64')

In [16]:
surveys_df.dtypes

record_id            int64
month                int64
day                  int64
year                 int64
plot_id              int64
species_id          object
sex                 object
hindfoot_length    float64
weight             float64
dtype: object

In [17]:
print(5+5)

10

In [18]:
print(5.5+5)

10.5

In [19]:
print(24 - 4)

20

In [20]:
print(5/9)

0.5555555555555556

In [21]:
print(10/3)

3.3333333333333335

In [23]:
a = 7.83
int(a)

7

In [24]:
b = 7

In [25]:
b

7

In [26]:
float(b)

7.0

In [28]:
surveys_df['record_id'] = surveys_df['record_id'].astype("float64")

In [29]:
surveys_df['record_id'].dtype

dtype('float64')

In [30]:
surveys_df['weight'].mean()

42.672428212991356

In [ ]:
len(surveys_df[pd.isnull(surveys_df.weight)])

In [32]:
pd.isnull(surveys_df.weight)

0         True
1         True
2         True
3         True
4         True
         ...
35544     True
35545     True
35546    False
35547    False
35548     True
Name: weight, Length: 35549, dtype: bool

In [33]:
surveys_df[pd.isnull(surveys_df.weight)]

,record_id,month,day,year,plot_id,species_id,sex,hindfoot_length,weight
0,1.0,7,16,1977,2,NL,M,32.0,NaN
1,2.0,7,16,1977,3,NL,M,33.0,NaN
2,3.0,7,16,1977,2,DM,F,37.0,NaN
3,4.0,7,16,1977,7,DM,M,36.0,NaN
4,5.0,7,16,1977,3,DM,M,35.0,NaN
...,...,...,...,...,...,...,...,...,...
35530,35531.0,12,31,2002,13,PB,F,27.0,NaN
35543,35544.0,12,31,2002,15,US,NaN,NaN,NaN
35544,35545.0,12,31,2002,15,AH,NaN,NaN,NaN
35545,35546.0,12,31,2002,15,AH,NaN,NaN,NaN
35548,35549.0,12,31,2002,5,NaN,NaN,NaN,NaN

In [34]:
df1 = surveys_df.copy()
df1['weight'] = df1['weight'].fillna(0)

In [35]:
df1[pd.isnull(df1.weight)]

Empty DataFrame
Columns: [record_id, month, day, year, plot_id, species_id, sex, hindfoot_length, weight]
Index: []

In [36]:
df1['weight'].mean()

38.751976145601844

In [37]:
surveys_df.to_csv("data/midata01.csv")